app/controllers/sessions_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`email` = 'phong@gmail.com' LIMIT 1
---
  def create
    user = User.find_by email: params.dig(:session, :email)&.downcase