app/controllers/users_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`id` = 4 LIMIT 1
---
    def show
        @user = User.find_by id: params[:id]

INSERT INTO `users` (`name`, `email`, `created_at`, `updated_at`, `password_digest`) VALUES ('phong', 'phong@gmail.com', '2023-03-09 11:42:41.317592', '2023-03-09 11:42:41.317592', '$2a$12$jjvI9CDkjuFZ0bRMurLtbemoX3iz3ge8h6NJgdquyquEp.EjucDFu')
---
    def create
        @user = User.new user_params # Not the final implementation!
        if @user.save